-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  test.log
  log type:  text
 opened on:  27 Oct 2015, 11:45:01

. webuse auto.dta
(1978 Automobile Data)

. 
. di "tab2r tab.RData"
tab2r tab.RData

. tab make foreign

                   |       Car type
    Make and Model |  Domestic    Foreign |     Total
-------------------+----------------------+----------
       AMC Concord |         1          0 |         1 
         AMC Pacer |         1          0 |         1 
        AMC Spirit |         1          0 |         1 
         Audi 5000 |         0          1 |         1 
          Audi Fox |         0          1 |         1 
          BMW 320i |         0          1 |         1 
     Buick Century |         1          0 |         1 
     Buick Electra |         1          0 |         1 
     Buick LeSabre |         1          0 |         1 
        Buick Opel |         1          0 |         1 
       Buick Regal |         1          0 |         1 
     Buick Riviera |         1          0 |         1 
     Buick Skylark |         1          0 |         1 
      Cad. Deville |         1          0 |         1 
     Cad. Eldorado |         1          0 |         1 
      Cad. Seville |         1          0 |         1 
    Chev. Chevette |         1          0 |         1 
      Chev. Impala |         1          0 |         1 
      Chev. Malibu |         1          0 |         1 
 Chev. Monte Carlo |         1          0 |         1 
       Chev. Monza |         1          0 |         1 
        Chev. Nova |         1          0 |         1 
        Datsun 200 |         0          1 |         1 
        Datsun 210 |         0          1 |         1 
        Datsun 510 |         0          1 |         1 
        Datsun 810 |         0          1 |         1 
        Dodge Colt |         1          0 |         1 
    Dodge Diplomat |         1          0 |         1 
      Dodge Magnum |         1          0 |         1 
   Dodge St. Regis |         1          0 |         1 
       Fiat Strada |         0          1 |         1 
       Ford Fiesta |         1          0 |         1 
      Ford Mustang |         1          0 |         1 
      Honda Accord |         0          1 |         1 
       Honda Civic |         0          1 |         1 
 Linc. Continental |         1          0 |         1 
      Linc. Mark V |         1          0 |         1 
  Linc. Versailles |         1          0 |         1 
         Mazda GLC |         0          1 |         1 
      Merc. Bobcat |         1          0 |         1 
      Merc. Cougar |         1          0 |         1 
     Merc. Marquis |         1          0 |         1 
     Merc. Monarch |         1          0 |         1 
        Merc. XR-7 |         1          0 |         1 
      Merc. Zephyr |         1          0 |         1 
           Olds 98 |         1          0 |         1 
    Olds Cutl Supr |         1          0 |         1 
      Olds Cutlass |         1          0 |         1 
     Olds Delta 88 |         1          0 |         1 
        Olds Omega |         1          0 |         1 
     Olds Starfire |         1          0 |         1 
     Olds Toronado |         1          0 |         1 
       Peugeot 604 |         0          1 |         1 
       Plym. Arrow |         1          0 |         1 
       Plym. Champ |         1          0 |         1 
     Plym. Horizon |         1          0 |         1 
     Plym. Sapporo |         1          0 |         1 
      Plym. Volare |         1          0 |         1 
    Pont. Catalina |         1          0 |         1 
    Pont. Firebird |         1          0 |         1 
  Pont. Grand Prix |         1          0 |         1 
     Pont. Le Mans |         1          0 |         1 
     Pont. Phoenix |         1          0 |         1 
     Pont. Sunbird |         1          0 |         1 
    Renault Le Car |         0          1 |         1 
            Subaru |         0          1 |         1 
     Toyota Celica |         0          1 |         1 
    Toyota Corolla |         0          1 |         1 
     Toyota Corona |         0          1 |         1 
         VW Dasher |         0          1 |         1 
         VW Diesel |         0          1 |         1 
         VW Rabbit |         0          1 |         1 
       VW Scirocco |         0          1 |         1 
         Volvo 260 |         0          1 |         1 
-------------------+----------------------+----------
             Total |        52         22 |        74 


. di "tab2r tabsum.RData"
tab2r tabsum.RData

. tab foreign, sum(mpg)

            |      Summary of Mileage (mpg)
   Car type |        Mean   Std. Dev.       Freq.
------------+------------------------------------
   Domestic |   19.826923   4.7432972          52
    Foreign |   24.772727   6.6111869          22
------------+------------------------------------
      Total |   21.297297   5.7855032          74

. di "tabstat2r tabstat.RData"
tabstat2r tabstat.RData

. tabstat mpg, by(foreign) stats(mean sd p25 p50 p75)

Summary for variables: mpg
     by categories of: foreign (Car type)

 foreign |      mean        sd       p25       p50       p75
---------+--------------------------------------------------
Domestic |  19.82692  4.743297      16.5        19        22
 Foreign |  24.77273  6.611187        21      24.5        28
---------+--------------------------------------------------
   Total |   21.2973  5.785503        18        20        25
------------------------------------------------------------

. di "list2r list.RData"
list2r list.RData

. list price mpg

     +--------------+
     |  price   mpg |
     |--------------|
  1. |  4,099    22 |
  2. |  4,749    17 |
  3. |  3,799    22 |
  4. |  4,816    20 |
  5. |  7,827    15 |
     |--------------|
  6. |  5,788    18 |
  7. |  4,453    26 |
  8. |  5,189    20 |
  9. | 10,372    16 |
 10. |  4,082    19 |
     |--------------|
 11. | 11,385    14 |
 12. | 14,500    14 |
 13. | 15,906    21 |
 14. |  3,299    29 |
 15. |  5,705    16 |
     |--------------|
 16. |  4,504    22 |
 17. |  5,104    22 |
 18. |  3,667    24 |
 19. |  3,955    19 |
 20. |  3,984    30 |
     |--------------|
 21. |  4,010    18 |
 22. |  5,886    16 |
 23. |  6,342    17 |
 24. |  4,389    28 |
 25. |  4,187    21 |
     |--------------|
 26. | 11,497    12 |
 27. | 13,594    12 |
 28. | 13,466    14 |
 29. |  3,829    22 |
 30. |  5,379    14 |
     |--------------|
 31. |  6,165    15 |
 32. |  4,516    18 |
 33. |  6,303    14 |
 34. |  3,291    20 |
 35. |  8,814    21 |
     |--------------|
 36. |  5,172    19 |
 37. |  4,733    19 |
 38. |  4,890    18 |
 39. |  4,181    19 |
 40. |  4,195    24 |
     |--------------|
 41. | 10,371    16 |
 42. |  4,647    28 |
 43. |  4,425    34 |
 44. |  4,482    25 |
 45. |  6,486    26 |
     |--------------|
 46. |  4,060    18 |
 47. |  5,798    18 |
 48. |  4,934    18 |
 49. |  5,222    19 |
 50. |  4,723    19 |
     |--------------|
 51. |  4,424    19 |
 52. |  4,172    24 |
 53. |  9,690    17 |
 54. |  6,295    23 |
 55. |  9,735    25 |
     |--------------|
 56. |  6,229    23 |
 57. |  4,589    35 |
 58. |  5,079    24 |
 59. |  8,129    21 |
 60. |  4,296    21 |
     |--------------|
 61. |  5,799    25 |
 62. |  4,499    28 |
 63. |  3,995    30 |
 64. | 12,990    14 |
 65. |  3,895    26 |
     |--------------|
 66. |  3,798    35 |
 67. |  5,899    18 |
 68. |  3,748    31 |
 69. |  5,719    18 |
 70. |  7,140    23 |
     |--------------|
 71. |  5,397    41 |
 72. |  4,697    25 |
 73. |  6,850    25 |
 74. | 11,995    17 |
     +--------------+

. 
. log close
      name:  <unnamed>
       log:  test.log
  log type:  text
 closed on:  27 Oct 2015, 11:45:01
-----------------------------------------------------------------------------------------------------------------------------------------------------------------------
